Tekla.Structures.Drawing.ReinforcementSingle
The ReinforcementSingle class defines a single (as in not part of a group) reinforcement bar in the drawing.

Tekla.Structures.Drawing.ReinforcementSingle.Attributes
The attributes of the reinforcement.
For more information see Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes.

Tekla.Structures.Drawing.ReinforcementSingle.ReinforcementCustomPosition
Defines the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized.
This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.

Tekla.Structures.Drawing.ReinforcementSingle.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ReinforcementSingle.#ctor
Create instance of Reinforcement

Tekla.Structures.Drawing.ReinforcementSingle.#ctor(System.Boolean)
Create instance of Reinforcement
SkipAttributes: Defines if attribute loading happens or not.